import pandas as pd
import numpy as np
import re
import json
import os


def main():
    properobj = {
        "基本存在": {
            "容量": "n",
            "事件数": "E",
        },
        "基本作用": {
            "观察概率": "<y|x>",
            "事件": "x",
        },
        "宏观空时": {
            "空间": "_概念",
            "时间": "_概念",
        },
        "史瓦西半径": {
            "半径": "r=2GM/c^2",
        },
        "基本单位": ["m", "s", "r", "q", "c", "h"],
        "解决公式": ["e=mc^2", "r=2GM/c^2", "<y|x>"],
        "待解决公式": ["红移", "s", "r", "q", "c", "h"],
    }
    triobj = [
        ["矩形", "属于", "平行四边形"],
        ["正方形", "属于", "矩形"],
        ["等角三角形", "等价", "等边三角形"],
        ["直径", "属于", "弦"],
        ["弦", "附属", "圆"],
        ["切线", "附属", "圆"],
    ]


if __name__ == "__main__":
    main()
